zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_LPI2C.h
#define LPI2C_SCFGR0_TXDSTALL_MASK               (0x4U)
#define LPI2C_SCFGR0_TXDSTALL_SHIFT              (2U)
/*! TXDSTALL - TX Data SCL Stall
 *  0b0..Clock stretching is disabled
 *  0b1..Clock stretching is enabled
 */
#define LPI2C_SCFGR0_TXDSTALL(x)                 (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_TXDSTALL_SHIFT)) & LPI2C_SCFGR0_TXDSTALL_MASK)

#define LPI2C_SCFGR0_ACKSTALL_MASK               (0x8U)
#define LPI2C_SCFGR0_ACKSTALL_SHIFT              (3U)
/*! ACKSTALL - ACK SCL Stall
 *  0b0..Clock stretching is disabled
 *  0b1..Clock stretching is enabled
 */
#define LPI2C_SCFGR0_ACKSTALL(x)                 (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_ACKSTALL_SHIFT)) & LPI2C_SCFGR0_ACKSTALL_MASK)

#define LPI2C_SCFGR0_GCEN_MASK                   (0x100U)
#define LPI2C_SCFGR0_GCEN_SHIFT                  (8U)
/*! GCEN - General Call Enable
 *  0b0..General Call address is disabled
 *  0b1..General Call address is enabled
 */
#define LPI2C_SCFGR0_GCEN(x)                     (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_GCEN_SHIFT)) & LPI2C_SCFGR0_GCEN_MASK)

#define LPI2C_SCFGR0_SAEN_MASK                   (0x200U)
#define LPI2C_SCFGR0_SAEN_SHIFT                  (9U)
/*! SAEN - SMBus Alert Enable
 *  0b0..Disables match on SMBus Alert
 *  0b1..Enables match on SMBus Alert
 */
#define LPI2C_SCFGR0_SAEN(x)                     (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_SAEN_SHIFT)) & LPI2C_SCFGR0_SAEN_MASK)

#define LPI2C_SCFGR0_TXCFG_MASK                  (0x400U)
#define LPI2C_SCFGR0_TXCFG_SHIFT                 (10U)
/*! TXCFG - Transmit Flag Configuration
 *  0b0..Transmit Data Flag will only assert during a slave-transmit transfer when the Transmit Data register is empty
 *  0b1..Transmit Data Flag will assert whenever the Transmit Data register is empty
 */
#define LPI2C_SCFGR0_TXCFG(x)                    (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_TXCFG_SHIFT)) & LPI2C_SCFGR0_TXCFG_MASK)

#define LPI2C_SCFGR0_RXCFG_MASK                  (0x800U)
#define LPI2C_SCFGR0_RXCFG_SHIFT                 (11U)
/*! RXCFG - Receive Data Configuration
 *  0b0..Reading the Receive Data register will return received data and clear the Receive Data flag (MSR[RDF]).
 *  0b1..Reading the Receive Data register when the Address Valid flag (SSR[AVF])is set, will return the Address
 *       Status register and clear the Address Valid flag. Reading the Receive Data register when the Address Valid
 *       flag is clear, will return received data and clear the Receive Data flag (MSR[RDF]).
 */
#define LPI2C_SCFGR0_RXCFG(x)                    (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_RXCFG_SHIFT)) & LPI2C_SCFGR0_RXCFG_MASK)

#define LPI2C_SCFGR0_IGNACK_MASK                 (0x1000U)
#define LPI2C_SCFGR0_IGNACK_SHIFT                (12U)
/*! IGNACK - Ignore NACK
 *  0b0..Slave will end transfer when NACK is detected
 *  0b1..Slave will not end transfer when NACK detected
 */
#define LPI2C_SCFGR0_IGNACK(x)                   (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_IGNACK_SHIFT)) & LPI2C_SCFGR0_IGNACK_MASK)

#define LPI2C_SCFGR0_HSMEN_MASK                  (0x2000U)
#define LPI2C_SCFGR0_HSMEN_SHIFT                 (13U)
/*! HSMEN - High Speed Mode Enable
 *  0b0..Disables detection of HS-mode master code
 *  0b1..Enables detection of HS-mode master code
 */
#define LPI2C_SCFGR0_HSMEN(x)                    (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR0_HSMEN_SHIFT)) & LPI2C_SCFGR0_HSMEN_MASK)
/*! @} */

/*! @name SCFGR1 - Slave Configuration Register 1 */
/*! @{ */

#define LPI2C_SCFGR1_ADDRCFG_MASK                (0x7U)
#define LPI2C_SCFGR1_ADDRCFG_SHIFT               (0U)
/*! ADDRCFG - Address Configuration
 *  0b000..Address match 0 (7-bit)
 *  0b001..Address match 0 (10-bit)
 *  0b010..Address match 0 (7-bit) or Address match 1 (7-bit)
 *  0b011..Address match 0 (10-bit) or Address match 1 (10-bit)
 *  0b100..Address match 0 (7-bit) or Address match 1 (10-bit)
 *  0b101..Address match 0 (10-bit) or Address match 1 (7-bit)
 *  0b110..From Address match 0 (7-bit) to Address match 1 (7-bit)
 *  0b111..From Address match 0 (10-bit) to Address match 1 (10-bit)
 */
#define LPI2C_SCFGR1_ADDRCFG(x)                  (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR1_ADDRCFG_SHIFT)) & LPI2C_SCFGR1_ADDRCFG_MASK)
/*! @} */

/*! @name SCFGR2 - Slave Configuration Register 2 */
/*! @{ */

#define LPI2C_SCFGR2_CLKHOLD_MASK                (0xFU)
#define LPI2C_SCFGR2_CLKHOLD_SHIFT               (0U)
/*! CLKHOLD - Clock Hold Time */
#define LPI2C_SCFGR2_CLKHOLD(x)                  (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR2_CLKHOLD_SHIFT)) & LPI2C_SCFGR2_CLKHOLD_MASK)

#define LPI2C_SCFGR2_DATAVD_MASK                 (0x3F00U)
#define LPI2C_SCFGR2_DATAVD_SHIFT                (8U)
/*! DATAVD - Data Valid Delay */
#define LPI2C_SCFGR2_DATAVD(x)                   (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR2_DATAVD_SHIFT)) & LPI2C_SCFGR2_DATAVD_MASK)
/*! @} */

/*! @name SCFGR3 - Slave Configuration Register 3 */
/*! @{ */

#define LPI2C_SCFGR3_FILTSCL_MASK                (0xFU)
#define LPI2C_SCFGR3_FILTSCL_SHIFT               (0U)
/*! FILTSCL - Glitch Filter SCL */
#define LPI2C_SCFGR3_FILTSCL(x)                  (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR3_FILTSCL_SHIFT)) & LPI2C_SCFGR3_FILTSCL_MASK)

#define LPI2C_SCFGR3_FILTSDA_MASK                (0xF00U)
#define LPI2C_SCFGR3_FILTSDA_SHIFT               (8U)
/*! FILTSDA - Glitch Filter SDA */
#define LPI2C_SCFGR3_FILTSDA(x)                  (((uint16_t)(((uint16_t)(x)) << LPI2C_SCFGR3_FILTSDA_SHIFT)) & LPI2C_SCFGR3_FILTSDA_MASK)
/*! @} */

/*! @name SAMR0 - Slave Address Match Register 0 */
/*! @{ */

#define LPI2C_SAMR0_ADDR0_MASK                   (0x7FEU)
#define LPI2C_SAMR0_ADDR0_SHIFT                  (1U)
/*! ADDR0 - Address 0 Value */
#define LPI2C_SAMR0_ADDR0(x)                     (((uint16_t)(((uint16_t)(x)) << LPI2C_SAMR0_ADDR0_SHIFT)) & LPI2C_SAMR0_ADDR0_MASK)
/*! @} */

/*! @name SAMR1 - Slave Address Match Register 1 */
/*! @{ */

#define LPI2C_SAMR1_ADDR1_MASK                   (0x7FEU)
#define LPI2C_SAMR1_ADDR1_SHIFT                  (1U)
/*! ADDR1 - Address 1 Value */
#define LPI2C_SAMR1_ADDR1(x)                     (((uint16_t)(((uint16_t)(x)) << LPI2C_SAMR1_ADDR1_SHIFT)) & LPI2C_SAMR1_ADDR1_MASK)
/*! @} */

